[  
   "Kalitine B. Method of semi definite Lyapunov’s functions in the stability theory. // Sixth Ariele conference ¨Functional Differential Equations and Applications 2017¨. August 21-26, 2017, at Ariel University, Israel. Program and Abstracts, 2017.",
   "Боголюбская-Синякова Е.С., Калитин Б.С. Об экстенсивном методе производства и торговли // Экономика, моделирование, прогнозирование: сб. научн. тр. Минск: НИЭИ Мин-ва экономики Респ. Беларусь, 2017. Вып. 11. С. 159−167.",
   "Kalitine B.S. On solving the problems of stability by Lyapunov’s direct method 2. // XVI International conference «Dynamical Systems Modeling and Stability Investigation - (DSMSI – 2017)», May 24-26, 2017. Taras Shevchenko National University of Kyiv, Ukraine.",
   "Калитин Б.С. On solving the problems of stability by Lyapunov’s direct method // XVII Междунар. научн. конф. по дифференциальным уравнениям «Еругинские чтения-2017», 16−20 мая, ч. 1, 2017 г. С. 89, Минск, Беларусь.",
   "Калитин Б.С., Кузьмич М.С. Модель экономического равновесия с учетом конкуренции на рынке // Белорусский экономический журнал. 2017. №1. С. 143–152. Belarusian Economic Journal. 2017. No 1. P. 143–152.",
   "Калитин Б.С. О решении задач устойчивости прямым методом Ляпунова // Известия Вузов. Математика. 2017. № 6. С. 33−43.",
   "Калитин Б.С., Кузьмич М.С. Метод вычисления ценовой эластичности спроса // Экономические исследования и разработки. Научно-исследовательский электронный журнал. Нижний Новгород: НОО «Профессиональная наука», № 4, 2016. С. 7−18.",
   "Калитин Б.С. Равновесие и эффекты экономики рынка. Saarbrücken: LAP Lambert Academic Publishing, 2016. 185 с.",
   "Kalitine B.S. Lyapunov Direct Method for Semidynamical Systems // Mathematical Notes, 2016, Vol. 100, No. 4, pp. 550–560. © Pleiades Publishing, Ltd., 2016. Original Russian Text © B. S. Kalitin, 2016, published in Matematicheskie Zametki, 2016, Vol. 100, No. 4, pp. 531–543.",
   "Калитин Б.С. К прямому методу Ляпунова для полудинамических систем // Математические заметки 2016. Т. 100, №. 4. С. 531–543.",
   "Калитин Б.С. О влиянии инноваций на равновесие рынка // Экономика, моделирование, прогнозирование: сб. научн. тр. Минск: НИЭИ Мин-ва экономики Респ. Беларусь, 2016. Вып. 10. С. 179−186.",
   "Калитин Б.С. О решении задач устойчивости прямым методом Ляпунова // Дифференц. уравнения. 2016. Т. 52. № 6. С. 839−840.",
   "Калитин Б.С. Динамика равновесия с учетом типа рынка // Матер. XVII Междунар. научн. конф. «Проблемы прогнозирования и государственного регулирования социально-экономического развития», (в 3 т.). Минск, 2016. Т. 3. С. 188−189.",
   "Калитин Б.С. Динамика цен рынка. Дискретные модели. Saarbrücken: LAP Lambert Academic Publishing, 2016. 157 с.",
   "Калитин Б.С. Об асимптотической устойчивости в полудинамических системах // Вестн. БГУ. Сер. 1, Физика. Математика. Информатика. 2016. № 1. С. 114–119. Kalitine B.S. About asymptotic stability in semidynamical systems. Vestnik BGU. Ser. 1, Fiz. Mat. Inform. 2016. No. 1. P. 114–119 (in Russ.).",
   "Cheban D.N., Kalitine B.S. On the stability of gradient-like systems // Международная математическая конференция \"Шестые Богдановские чтения по обыкновенным дифференциальным уравнениям\", 7-10 декабря 2015. Материалы конференции, ч. 1, Минск, 2015. С. 90-92.",
   "Калитин Б.С. Классификация и устойчивость рынка трех товаров // Вестник БГУ. Сер. 1. Физ. Мат. Информ. 2015. № 3. С. 89−95.",
   "Калитин Б.С., Кузьмич М.С. К устойчивости рынка трех товаров // Экономика, моделирование, прогнозирование: сб. научн. тр. Минск: НИЭИ Мин-ва экономики Респ. Беларусь, 2015. Вып. 9. С. 136−144.",
   "Калитин Б.С. О некоторых свойствах псевдоустойчивости и псевдопролонгации // Вестник БГУ. Сер. 1. Физ. Мат. Информ. 2015. № 2. С. 77−83.",
   "Kalitine B.S. On the pseudo-stability of semidynamical systems // Вестник БГУ. Сер. 1. Физ. Мат. Информ. 2015. № 1. С. 79−84.",
   "Калитин Б.С. О проблемах устойчивости неавтономных дифференциальных уравнений (Метод знакопостоянных функций Ляпунова). Saarbrücken: LAP Lambert Academic Publishing, 2015. 269 с.",
   "Калитин Б.С. Об устойчивости рынка трех взаимодополняющих товаров // Вестник БГУ. Сер. 1. Физ. Мат. Информ. 2014. № 3. С. 72−76.",
   "Cheban D.N. and Kalitine B.S., On the stability of gradient-like systems // International Journal of Evolution Equations, 2014, Volume 9, Number 2, pp. 151–166.",
   "Калитин Б.С. Развитие идеи Барбашина−Красовского в прямом методе Ляпунова // Международная конференция «Динамика систем и процессы управления» (SDCP’2014), Екатеринбург, 15−20 сентября 2014 г. Тез. докладов. Екатеринбург: Издательский центр Институт математики и механики УрО РАН. С. 96−98.",
   "Калитин Б.С., Шабур Р. Об устойчивости дискретных неавтономных систем // Труды XII Всероссийского совещания по проблемам управления ВСПУ-2014. Москва 16− 19 июня 2014 г. С. 868−881.",
   "Калитин Б.С. Еще раз о паутинообразной модели рынка // Матер. XIV Междунар. научн. конф. «Проблемы прогнозирования и государственного регулирования социально-экономического развития», (в 3 т.). Минск, 2014. Т. 3. С. 198−199.",
   "Калитин Б.С. B-устойчивость: принцип сведения и устойчивость по первому приближению // Дифференц. уравнения. 2014. Т. 50. № 6. С. 849−850.",
   "Damak H.  Hammami M.A., Kalitine B. On the Global Uniform Asymptotic Stability of Time-Varying Systems // Differential Equations and Dynamical Systems. April 2014, Volume 22, Issue 2, pp 113124.",
   "Калитин Б.С. Дискретная модель «спрос − предложение» в условиях меняющихся цен // Экономика, моделирование, прогнозирование: сб. научн. тр. Минск: НИЭИ Мин-ва экономики Респ. Беларусь, 2014. Вып. 8. С. 159−165.",
   "Калитин Б.С. Об устойчивости рынка трех взаимозаменяемых товаров // Вестник БГУ. Сер. 1. Физ. Мат. Информ. 2014. № 2. С. 62−67.",
   "Калитин Б.С.  Метод знакопостоянных функций Ляпунова для почти периодических систем // XVI Междунар. научн. конф. по дифференциальным уравнениям «Еругинские чтения-2014», 20−22 мая, ч. 1, 2014 г. С. 91−92, Новополоцк, Беларусь.",
   "Kalitine B.S., Kalitine P.B. Оn the stability of almost periodic systems // Вестник Белорус. ун-та. Сер. 1. Физ. Мат. Информ. 2014. № 1. С. 78−82.",
   "Калитин Б.С. Устойчивость неавтономных дифференциальных уравнений. Минск: БГУ, 2013. 227 с.",
   "Калитин Б.С., Соловьева А.С. Устойчивость динамической модели реализации продуктов с учетом издержек производства // Экономика, моделирование, прогнозирование: сб. научн. тр. Минск: НИЭИ Мин-ва экономики Респ. Беларусь, 2013. Вып. 7. С. 159−165.",
   "Вивальда Ж.-К., Калитин Б.С. К теореме о неустойчивости неавтономных дифференциальных уравнений // Международная конференция \"Динамические системы: устойчивость, управление, оптимизация\" к 95-летию со дня рождения академика Е.А. Барбашина, 15 октября 2013 г. Тез. докладов. Минск: Издательский центр БГУ, 2013. С. 8890.",
   "Калитин Б.С. Об устойчивости равновесия неавтономных дифференциальных уравнений // Вестник Белорус. ун-та. Сер. 1. Физ. Мат. Информ. 2013. № 1. С. 70−75.",
   "Kalitine B, Kalitine P. On the relative stability of almost periodic differential equations // Scientific Enquiry in the Contemporary World: Theoretical Busies and Innovative Approach. L&L Publishing Titusville, FL, USA. 2013. Vol. 1 Natural sciences. P. 13−19.",
   "Калитин Б.С. Устойчивость модели производства и реализации продукции в критическом случае пары чисто мнимых корней // Матер. XIII Междунар. научн. конф. «Проблемы прогнозирования и государственного регулирования социально-экономического развития», (в 3 т.). Минск, 2013. Т. 3. С. 198−199.",
   "Калитин Б.С. Устойчивость динамических систем (Метод знакопостоянных функций Ляпунова). Saarbrücken: LAP Lambert Academic Publishing, 2013. 259 с.",
   "Калитин Б.С. К устойчивости замкнутых множеств динамических систем // Вестник Белорус. ун-та. Сер. 1. Физ. Мат. Информ. 2012. № 3. С. 131−135.",
   "Калитин Б.С. Динамические модели первого и второго порядков конкурентного рынка // Экономика, моделирование, прогнозирование: сб. научн. тр. Минск: НИЭИ Мин-ва экономики Респ. Беларусь, 2012. Вып. 6. C. 145−151.",
   "Гаврош Е.С., Калитин Б.С. Теорема о неустойчивости дискретных неавтономных систем // Вестник Белорус. ун-та. Сер. 1. Физ. Мат. Информ. 2012. № 2. С. 111−115.",
   "Калитин Б.С., Соловьева А.С. Устойчивость модели производства и реализации продукции в критическом случае пары чисто мнимых корней // Матер. XIII Междунар. научн. конф. «Проблемы прогнозирования и государственного регулирования социально-экономического развития» (в 3 т.) Минск, 2012. Т. 3. С. 230−231.",
   "Калитин Б.С. Устойчивость динамических систем (Качественная теория). Saarbrucken: LAP Lambert Academic Publishing, 2012. 258 с.",
   "Калитин Б.С. Устойчивость равновесия конкурентного рынка (Динамическая модель рынка). Saarbrücken: LAP Lambert Academic Publishing, 2012. 168 с.",
   "Калитин Б.С. Устойчивость дифференциальных уравнений (Метод знакопостоянных функций Ляпунова). Saarbrücken: LAP Lambert Academic Publishing, 2012. 230 с.",
   "Калитин Б.С., Шабур Р. Метод знакопостоянных функций Ляпунова для систем неавтономных дифференциальных уравнений // Известия вузов. Математика. 2012, №5, c. 28–39.",
   "Калитин Б.С., Сущ Т.Б. Динамическая модель производства и реализации продукции // Вестник Белорус. ун-та. Сер. 1. Физ. Мат. Информ. 2012. № 1. С. 110−116.",
   "Калитин Б.С., Трухан Е.В. Динамическая модель рынка двух товаров с нулевым запасом прочности // Управление Экономическими системами (УЭкС), Инструментальные методы экономики. (35) 11/2011. № гос. рег. статьи: 0421100034/ (№ регистрации СМИ: ЭЛ №ФС77-35217 от 06.02.2009 г. ISSN: 1999-4516).",
   "Калитин Б.С., Гаврош Е.С. Дискретная неавтономная математическая модель регулируемого рынка // Матер. XII Междунар. конф. «Проблемы прогнозирования и государственного регулирования социально-экономического развития» (в 3 т.) Минск, 2011. Т. 3. С. 186−187.",
   "Калитин Б.С., Трухан Е.В. Устойчивость рынка двух взаимодополняющих товаров // Сб. научных трудов «Экономика, моделирование, прогнозирование». Минск, 2011, вып. 5, С. 213−225.",
   "Калитин Б.С. Математические модели первого порядка конкурентного рынка. Минск, БГУ, 2011. 131 с.",
   "Калитин Б.С., Трухан Е.В. Устойчивость рынка двух взаимозаменяемых товаров // Вестник Белорус. ун-та. Сер. 1. Физ. Мат. Информ. 2011. № 2. С. 91−95, 151.",
   "Калитин Б.С. Проблема Флорио − Сейберта и прямой метод Ляпунова для полудинамических систем / Б.С. Калитин // Матер. Междунар. матем. конф. «Пятые Богдановские чтения по обыкновенным дифференциальным уравнениям». − Минск, 2010. − С. 33−34.",
   "Калитин Б.С., Сущ Т.Б. Двухконкурентная динамическая модель производства и реализации продукции / Б.С. Калитин, Т.Б. Сущ // Матер. X Междунар. конф. «Проблемы прогнозирования и государственного регулирования социально-экономического развития». (в 5 т.) − Минск, 2010. − Т. 5. − С. 38−40.",
   "Калитин Б.С., Гаврош Е.С. Устойчивость дискретной динамической модели монопольного рынка // Сб. научных трудов «Экономика, моделирование, прогнозирование». Минск, 2010, вып. 4, С. 240−249.",
   "Калитин Б.С., Безрук В.В. Модель первого порядка монопольного рынка // Тр. ин−та математики. − 2009. Т. 17. − № 1. − С. 61−70.",
   "Калитин Б.С., Сущ Т.Б. Динамическая модель производства и реализации продукции / Б.С. Калитин, Т.Б. Сущ // Матер. X Междунар. конф. «Проблемы прогнозирования и государственного регулирования социально-экономического развития». (в 4 ч.) − Минск, 2009. − Ч. 4. − С. 221−223.",
   "Kalitine B. Method of semi definite Lyapunov's function systems of nonautonomous differential equations / B. Kalitine, R. Chabour // Mathematical Modeling and Differential Equations: resumé presentations, Minsk (Belarus), 24−28 August 2009. − Minsk, 2009. −P. 175−177.",
   "Калитин Б.С., Пристрем Е.А. Модель первого порядка рынка двух конкурентов с эфффектом рекламы // Вестник Белорус. ун-та. Сер. 1. Физ. Мат. Информ. 2009. № 2. С. 74−81.",
   "Калитин Б.С. Неустойчивость замкнутых инвариантных множеств полудинамических систем. Метод знакопостоянных функций Ляпунова // Математические заметки, 2009. Т. 85. Вып. 3 март. С. 382− 394.",
   "Амелькин В.В., Калитин Б.С. Нелинейные изохронные и импульсные колебания в динамических системах второго порядка. БГУ, 2008. 148 с.",
   "Калитин Б.С., Трухан Е.В. Об оптимальной налоговой политике на рынке двух взаимозаменяемых товаров // Вестник Белорус. ун-та. Сер. 1. Физ. Мат. Информ. 2008. № 3. С. 80−85, 122.",
   "Калитин Б.С. Экономические силы моделей конкурентного рынка // IX Международная научная конференция «Проблемы прогнозирования и государственного регулирования социально-экономического развития», 16 − 17 октября 2008 г. Материалы IX Междунар. науч. конф. (Минск, 16−17 окт. 2008 г.) В 4 т. Т. 4 / редкол.: С.С. Полоник [и др.]. − Мн.: НИЭИ Мин-ва экономики Респ. Беларусь. − 2008. − С. 204−206.",
   "Kalitine B., Chabour R., Vivalda J.-C. A Theorem of Instability // Международная конференция \"Динамические системы: устойчивость, управление, оптимизация\" к 90-летию со дня рождения академика Е.А. Барбашина (1918-1969), 29 сентября - 4 октября 2008 г. Тезисы докладов. Мн.: Институт математики НАН Беларуси, 2008. С. 28−30.",
   "Калитин Б.С., Гаврош Е.С. Устойчивость модели конкурентных отношений на товарных рынках // Международная конференция \"Динамические системы: устойчивость, управление, оптимизация\" к 90-летию со дня рождения академика Е.А. Барбашина (1918-1969), 29 сентября − 4 октября 2008 г. Тезисы докладов. Мн.: Институт математики НАН Беларуси, 2008. С. 88−89.",
   "Калитин Б.С. О рыночном равновесии // Экономика и управление. 2008. № 3 (15). С. 2428.",
   "Kalitine B., Vivalda J-C., A Theorem of Unstability // Вестник Белорус. ун-та. Сер. 1. Физ. Мат. Информ. 2008. № 1. С. 55−58.",
   "Калитин Б.С., Трухан Е.В. Модель рынка двух взаимодополняющих товаров // Тез. доклада XVI Международной научн. конф. \"Управление в социальных и экономических системах \". Минск, 16-17 июня 2007 // Материалы конф. С. 368.",
   "Калитин Б.С. Экономические модели второго порядка конкурентного рынка. − Минск, БГУ, 2007. 96 с.",
   "Калитин Б.С. О принципе сведения для асимптотически треугольных дифференциальных систем // Прикладная математика и механика. 2007. Т. 71. Вып. 3. С. 389−400.",
   "Калитин Б.С. Модель второго порядка рынка типа «эффективная конкуренция» // Вестник Белорус. гос. ун-та. Сер. 1. Физ. Мат. Информ. 2006. № 3. С. 122−127.",
   "Калитин Б.С. Модели второго порядка конкурентного рынка // Тез. докл. VII Междунар. научн. конф. «Проблемы прогнозирования и государственного регулирования социально-экономического развития» 19−20 октября 2006 г. Минск, 2006. С.",
   "Калитин Б.С. Механика движения цен на конкурентном рынке // Тр. ин−та математики. 2006. Т. 14. № 1. С. 62−70.",
   "Амелькин В.В., Калитин Б.С. Изохронные и импульсные колебания двумерных динамических систем. М.: КомКнига, 2006. – 208 с.",
   "Калитин Б.С. B-устойчивость и ее приложения Тез. Докл. Междунар. Конф. Четвертые Богдановские чтения по обыкновенным дифференциальным уравнениям Минск, 2005. С. 100−101.",
   "Калитин Б.С. Задачи по теоретической механике. Минск, БГУ, 2005. 199 с.",
   "Vivalda J-C., Kalitin B. La-Sall's invariance principle and method of semi definite functions // Вестник Белорус. гос. ун-та. Сер. 1. Физ. Мат. Информ. 2006. № 1. С. 62−67.",
   "Калитин Б.С. О структуре окрестности устойчивых компактных инвариантных множеств // Дифференц. уравнения. 2005. Т. 41. № 8. С. 1062–1073.",
   "Калитин Б.С. Регламентируемая монополия. Модель второго порядка // Вестн. Белорус. гос. ун-та. Сер. 1: Физ. Мат. Информ. 2005, № 2. С. 80−84.",
   "Калитин Б.С. Математические модели экономики. Минск, БГУ, 2004. 182 с.",
   "Калитин Б.С. Классификация устойчивых компактных инвариантных множеств динамических систем. Тез. докл. Междунар. конф. IX Конфер. матеатиков Беларуси. Гродно, 3−6 ноября 2004. С. 132−133.",
   "Калитин Б.С. Устойчивость неизолированных состояний равновесия // Вестник Белорус. ун-та. Сер. 1. 2004. № 3. С. 79−83.",
   "Калитин Б.С. Модель второго порядка монопольного рынка // Экономика. Управление. Право. 2004, № 2. С. 3−6.",
   "Kalitine B. Sur le théorème de la stabilité non asymptotique dans la méthode directe de Lyapunov. C. R. Acad. Sci. Paris, Ser. I 338 (2004) 163−166.",
   "Калитин Б.С. Модель второго порядка монопольного рынка. Материалы Х Междунар. Научно-практической конф. «Управление в социальных и экономических системах» Минск, 30 ноября 2003 г. С. 245.",
   "Калитин Б.С. Устойчивость динамической модели монопольного рынка // Вестн. Белорусского ун-та. Сер. 1, физ., мат., инф., 2003, № 3. С. 67–72.",
   "Калитин Б.С. Регулятор инфляции фискального типа. Материалы I Междунар. научн. конф. «Математическое моделирование экономических процессов переходного периода». Минск, 29−31 октября 2003. С. 74−75.",
   "Калитин Б.С. Устойчивость замкнутых инвариантных множеств полудинамических систем. Метод знакопостоянных функций Ляпунова. // Дифференц. уравнения. 2002. Т. 38. № 11. С. 1565–1566.",
   "Калитин Б.С. Равномерная интегральная непрерывность неавтономных дифференциальных уравнений // Вестник Белорус. ун-та. Сер. 1. 2002. № 3. С. 64–68.",
   "Калитин Б.С. Качественная теория устойчивости движения динамических систем. Минск, БГУ, 2002. 198 с.",
   "Kalitine B. Method of sign-constant Liapunov functions for nonautonomous differential systems. Colloque “Commande des systèmes non linéaires”. Metz, 2002. P. 23−24.",
   "Khusainov T., Kalitin B. On dynamical pricing model. Nonlinear Analysis: Real World Applications 3 (2002) 131−137.",
   "Chabour R., Kalitine B. Semi-Definite Lyapunov Functions. Stability and Stabilizability. Prépublication Mathématiques. Université de Metz. Lab. M.M.A.S. 2001, № 2. P. 119.",
   "Калитин Б.С. Развитие метода знакопостоянных функций Ляпунова. Выбраныя навуковыя працы БДУ. Т. Матэматыка, Мiнск−2001. С. 232−257.",
   "Амелькин В.В., Калитин Б.С. О некоторых свойствах осциллятора Льенара «имеющего собственный период». Тез. доклад. Междун. конф. «Третьи научные чтения по обыкновенным дифференциальным уравнениям», посвященные 80-летию со дня рождения Ю. С. Богданова. Минск, 26 февраля − 1 марта 2001 г. С. 42−43.",
   "Калитин Б.С. Математические модели экономики. Методические указания по спецкурсу. Минск: БГУ, 2001. 29 с.",
   "Калитин Б.С., Сари Т. В-устойчивость и ее приложения к теоремам Тихонова и Малкина − Горшина // Дифференц. уравнения. 2001. Т. 37. № 1. С. 12–17.",
   "Калитин Б.С., Калитина Л.В. Построение оптимальных оценок области притяжения методом функций Ляпунова. Тез. докл.  Пятой Крымской Междун. матем. школы МФЛ. Крым, Алушта, 2000. С 93.",
   "Калитин Б.С. Метод знакопостоянных функций Ляпунова для полудинамических систем. Тез. докл. Пятой Крымской Междун. матем. школы МФЛ. Крым, Алушта, 2000. С 92.",
   "Калитин Б.С. Динамическая модель рынка типа «эффективная конкуренция» с подсистемой объемов продаж // Вестник Белорус. ун-та. Сер. 1. 2000. № 1. С. 42–47.",
   "Баулин А.С., Калитин Б.С. Метод знакопостоянных функций Ляпунова для дискретных неавтономных систем // Весцi НАН Беларуси. Сер. фiз.-мат. н. 2000. № 1. С. 28−34.",
   "Iggidr A., Kalitine B. S., Gauthier Sallet. Lyapunov Theorems with semidefinite Functions (1999) IFAC  Triennial World Congress, Beijing, P.R. China. P. 231−236.",
   "Iggidr A., Kalitine B.S., Vivalda J.-Claude New Lyapunov-like theorems for non Lipschitz vector filds.  IEEE Conference on Decision and Control, Phoenix, Arizona, USA, December 7-10, 1999.",
   "Калитин Б.С. В-устойчивость и проблема Флорио-Сейберта // Дифференц. уравнения. 1999. Т. 35. № 4. С. 453–463.",
   "Калитин Б.С., Люц Р. Динамика цены на свободном рынке: модель второго порядка // Белорусский экономический журнал. 1999. № 1. С. 120−127.",
   "Калитин Б.С. Качественная характеристика траекторий в окрестности притягивающего компактного множества // Дифференц. уравнения. 1998. Т. 34. № 7. С. 886–893.",
   "Калитин Б.С. Динамическая модель рынка типа «эффективная конкуренция». Неотрицательный запас прочности // Вестник Белорус. ун-та. Сер. 1, Физика. Математика. Информатика. 1998. № 2. С. 41–45.",
   "Амелькин В.В., Калитин Б.С. Идеальная «двухударная» модель часов с аналитическим сильно изохронным осциллятором свободных колебаний // ПММ. 1998. Т. 62. Вып. 1. С. 92−99.",
   "Калитин Б.С. Методические указания по спецкурсу «Устойчивость равновесия экономических моделей». Минск: БГУ, 1997.",
   "Калитин Б.С. Динамическая модель рынка типа «эффективная конкуренция» // Вестник Белорус. ун-та. Сер. 1, Физика. Математика. Информатика. 1997. № 2. С. 68–70.",
   "Iggidr A., Kalitine B.S. and Outbib R. Semidefinite Lyapunov Functions Stability and Stabilization // Math. of Control, Signals and Systems (1996) 9: 95−106.",
   "Калитин Б.С. Псевдопролонгация // Дифференц. уравнения. 1996. Т. 32. № 8. С.1043–1050.",
   "Калитин Б.С. Динамическая модель рынка. Тез. докл. Междунар. конф. «устойчивость и управление для трансформирующихся систем». Москва, 1995. С. 53.",
   "Калитин Б.С., Мурач В.А. Устойчивость неавтономных систем по части переменных. Метод знакопостоянных функций Ляпунова // Вестник Белорус. ун-та. Сер. 1, физ., мат., мех., 1995. № 3. С. 71–72.",
   "Калитин Б.С. К методу знакопостоянных функций Ляпунова для неавтономных дифференциальных систем // Дифференц. уравнения. 1995. Т. 31. № 4. С. 583–590.",
   "Калитин Б.С., Калитина Л.В. Оптимизация оценки области притяжения методом функций Ляпунова // Вестник Белорусского ун-та. Сер. 1, физ., мат., мех., 1994. № 3. С. 54−57.",
   "Калитин Б.С. О структуре окрестности слабо притягивающих компактных инвариантных множеств // Дифференц. уравнения. 1994. Т. 30. №  4. С. 565−574.",
   "Калитин Б.С. Классификация устойчивых компактных множеств. Тез. докл. Междунар. мат. конф., посвященной 200-летию со дня рожд. Н.И. Лобачевского. Ч. 2. Минск, 1993. С. 32.",
   "Калитин Б.С., Третьякова Л.В. Оценка области притяжения методом функций Ляпунова // Развитие и применение метода функций Ляпунова. РАН СО, Иркутск, ВЦ, Новосибирск, 1992. С. 210−215.",
   "Калитин Б.С. Методическое пособие по курсу «Теория устойчивости». Минск, БГУ: 1991г. 27 с.",
   "Калитин Б.С. Развитие теоремы Ляпунова об устойчивости // Дифференц. уравнения. 1991. Т. 27. №  5. С. 758−766.",
   "Калитин Б.С. О решении задач устойчивости методом знакопостоянных функций Ляпунова // Проблемы аналитической механики, устойчивости и управления. Новосибирск, 1991. С. 79−85.",
   "Калитин Б.С., Мороз О.А. Исследование устойчивости неизолированных точек покоя методом функций Ляпунова. Тез. докл.  школы-семинара «Моделирование и исследование устойчивости физических процессов», Киев, 1990. С.",
   "Калитин Б.С., Третьякова Л.В. О некоторых свойствах функций Ляпунова с точки зрения оценки области притяжения. Тез. докл. 4-й Уральской региональной конф. «Функционально-дифференциальные уравнения и их приложения». Уфа, 1989. С. 54.",
   "Калитин Б.С. К задаче Флорио-Сейберта // Дифференц. уравнения. 1989. Т. 25. №  4. С. 727−729.",
   "Калитин Б.С. Пролонгации и устойчивость динамических систем. Тез. докл.  7-й Всесоюзной конф. «Качественная теория дифференциальных систем». Рига, 1989. С. 112.",
   "Калитин Б.С., Третьякова Л.В. Некоторые свойства поверхностей уровня функций Ляпунова. Ред. ж. Изв. АН БССР. Сер. физ.-мат. н. Минск, 1989. Деп. в ВИНИТИ 15.02.89. № 989−В89.",
   "Калитин Б.С. Непрерывность псевдопролонгаций // Дифференц. уравнения. 1989. Т. 25. №  12. С. 2187.",
   "Калитин Б.С. Устойчивость неавтономных динамических систем // Актуальные задачи теории динамических систем управления. Минск, 1989. С. 37−46.",
   "Калитин Б.С. Характеристика компактных слабо притягивающих положительно инвариантных множеств // Дифференц. уравнения. 1988. Т.24. №  6. С. 1085.",
   "Калитин Б.С. Псевдоустойчивость и первые продолжения // Дифференц. уравнения. 1988. Т. 24. №  4. С. 571−574.",
   "Калитин Б.С., Третьякова Л.В. Оценка области асимптотической устойчивости голоморфных систем. Тез. докл.  Республиканской научно-технической конф. «Применение вычислительной техники и математических методов в научных и экономических исследованиях». Киев, 1988. С. 49.",
   "Калитин Б.С. Инвариантность свойств устойчивости при гомоморфизме динамических систем // Докл. АН БССР. 1988. Т. XXХII. №  10. С. 869−871.",
   "Калитин Б.С. Классификация компактных инвариантных множеств // Докл. АН БССР. 1987. Т. XXХI. №  11. С. 971−974.",
   "Калитин Б.С. К методу сравнения для задач устойчивости периодических систем // Дифференц. уравнения. 1987. Т. 23. №  3. С. 424−428.",
   "Калитин Б.С. Относительная устойчивость компактных множеств // Вестник Белорусского ун-та. Сер. 1, физ., мат., мех., 1987. № 1. С. 34−36.",
   "Калитин Б.С., Мороз О.А. К устойчивости неизолированной точки покоя в критических случаях. Тез. докл.  Республиканской научно-технической конф. «Применение вычислительной техники, математических методов и моделирования в автоматизации экспериментальных исследований». Киев, 1987. С. 49−50.",
   "Калитин Б.С., Третьякова Л.В. Оценка области притяжения экологической системы Лотки−Вольтерра. Тез. докл.  Республиканской научно-технической конф. «Применение вычислительной техники, математических методов и моделирования в автоматизации экспериментальных исследований». Киев, 1987. С. 45−47.",
   "Калитин Б.С. Устойчивость при наличии интегральной поверхности. // Динамические процессы и их устойчивость. Якутск, 1987. С. 78−86.",
   "Калитин Б.С. О неасимптотичеcкой устойчивости инвариантных множеств // Изв. ВУЗов. Математика. 1986. № 8. С. 31−34.",
   "Калитин Б.С. Устойчивость при наличии первых интегралов // Вестник Белорусского ун-та. Сер. 1, физ., мат., мех., 1986. № 3. С. 69−70.",
   "Калитин Б.С. Дополнение к одной теореме Г.В. Каменкова. Тез. докл. Всесоюзной конф. «Метод функций А. М. Ляпунова в современной математике». Харьков, 1986. С. 152.",
   "Калитин Б.С., Третьякова Л.В. Оценка области притяжения в простейших критических случаях. Тез. докл. Всесоюзной конф. «Метод функций А.М. Ляпунова в современной математике». Харьков, 1986. С. 25.",
   "Калитин Б.С. О решении задач устойчивости методом знакопостоянных функций Ляпунова. Тез. докл. 6-й Всесоюзной конф. «Качественная теория дифференциальных уравнений». Иркутск, 1986. С. 83−84.",
   "Калитин Б.С. Псевдоустойчивость замкнутых инвариантных множеств // Дифференц. уравнения. 1986. Т. 22. № 2. С. 187−193.",
   "Калитин Б.С. Оценка области притяжения в некритическом случае // Докл. АН БССР. 1985. Т. XXIХ. № 5. С. 400−402.",
   "Калитин Б.С. Устойчивость неизолированной точки покоя // Вестник Белорусского ун-та. Сер. 1, физ., мат., мех., 1985. № 3. С. 39−41.",
   "Калитин Б.С. Оценка области притяжения в критическом случае одного нулевого корня. Белорусский ун-т. Минск, 1984. Деп. в ВИНИТИ 18.12.84. № 8023−84.",
   "Калитин Б.С. К устойчивости компактных множеств // Вестник Белорусского ун-та. Сер. 1, физ., мат., мех., 1984. № 3. С. 61−62.",
   "Калитин Б.С. К устойчивости многосвязных систем. 5-е Всесоюзное совещание «Управление многосвязными системами», Тбилиси, 1984.",
   "Калитин Б.С. Минимальная устойчивость решений дифференциальных систем // Вестник Белорусского ун-та. Сер. 1, физ., мат., мех., 1984. №  2. С. 30−32.",
   "Kalitine B.S. Generalisation d'un résultat de P. Seibert sur la stabilité. II Rencontre Nationale sur les Equations Différentielles Ordinaires. Résumés des exposés. Alger : USTHB, 1983. P. 30−31.",
   "Kalitine B.S. Pseudo-stabilité et classification des ensembles fermés invariants // Prepublication USTHB, B.P. 9 Dar El-Beida (Alger), 1983. № 9. P. 1−12.",
   "Калитин Б.С. Стабилизация без скольжения линейной системы с переменной структурой // Вестник Белорусского ун-та. Сер. 1, физ., мат., мех., 1983. №  1. С. 56−57.",
   "Калитин Б.С. К устойчивости существенно нелинейных систем // Вестник Белорусского ун-та. Сер. 1, физ., мат., мех., 1983. № 1. С. 33−35.",
   "Kalitine B. Sur la stabilite des ensembles compacts positivement invariants des systemes dynamiques // R.A.I.R.O. Automatique/Systems Analysis and Control, 1982. V.16. № 3. P. 275−286.",
   "Калитин Б.С., Руссев Э. Качественная характеристика окрестности устойчивого нулевого решения дискретной системы // Научни трудове, 1982. V. 20, кн. 1. P. 109−119. (БНР) Пловдивский ун-т «Паисий Хилендарский» (Unuversité de Plovdiv “Paissi Hilendarski”, Travaux scientifiques, 1982. V. 20, fasc. I. P. 109−119 − Mathématiques).",
   "Калитин Б.С. Некоторые признаки ограниченности решений // Вестник Белорусского ун-та. Сер. 1, физ., мат., мех., 1982. № 1. С. 53−55.",
   "Калитин Б.С. К устойчивости разрывных предельных циклов двумерных автономных систем // Вестник Белорусского ун-та. Сер. 1, физ., мат., мех., 1981. № 2. С. 44−48.",
   "Калитин Б.С. Одна теорема о неустойчивости // Вестник Белорусского ун-та. Сер. 1, физ., мат., мех., 1980. № 3. С. 49−50.",
   "Kalitine B., Lobry C. Complète contrôllabilité de certains systèmes non linéaires // Revue Roumaine de Math. Pur. et Appl. 1979. V.24. № 2. P. 255−279.",
   "Калитин Б.С., Кац Я.Д. Специальные свойства производных по начальным данным // Вестник Белорусского ун-та. Сер. 1, физ., мат., мех., 1979. № 1. С. 65−67.",
   "Булгаков Н.Г., Калитин Б.С., Покатаев А.В. К устойчивости дискретных автономных систем. Белорусский ун-т. Минск, 1979. Деп. в ВИНИТИ 26.04.79. № 1543−79.",
   "Калитин Б.С. О построении знакопостоянных функций Ляпунова. Белорусский ун-т. Минск, 1979. Деп. в ВИНИТИ 17.05.79. № 1760−79.",
   "Калитин Б.С. К вопросу о равномерной асимптотической устойчивости // Докл. АН БССР. 1979. Т.XXIII. № 4. С. 300−303.",
   "Калитин Б.С. К задаче стабилизации. Белорусский ун-т. Минск. 1979. Деп. в ВИНИТИ 20.02.79. № 653−79.",
   "Калитин Б.С., Городецкий Л.М. О понижении размерности задачи Айзермана // Изв. АН БССР. Сер. физ.-мат. н. 1979. №  2. С. 21−24.",
   "Булгаков Н.Г., Калитин Б.С. Обобщение теорем второго метода Ляпунова. II. Примеры // Изв. АН БССР. Сер. физ.-мат. н. 1979. №  1. С. 70−74.",
   "Калитин Б.С., Черчук М.Л. К проблеме Айзермана для систем второго порядка. Белорусский ун−т. Минск, 1978.  с. Деп. в ВИНИТИ. 20.07.78. № 2471−78.",
   "Булгаков Н.Г., Калитин Б.С. Обобщение теорем второго метода Ляпунова.I. Теория //Изв. АН БССР. Сер. физ.-мат. н. 1978. №  3. С. 32−36.",
   "Калитин Б.С. r-ограниченность решений дифференциальных систем. Белорусский ун-т. Минск, 1978.  с. Деп. в ВИНИТИ. 15.05.78. № 1571−78.",
   "Калитин Б.С. К устойчивости систем третьего порядка. // Вестник Белорусского ун-та. Сер. 1, физ., мат., мех., 1977. № 2. С. 70−73.",
   "Калитин Б.С. Полная управляемость линейных систем с переменной структурой. // Дифференц. уравнения, 1977. Т. 13. № 3. С. 556−558.",
   "Balabanov A., Kalitine B. Synthèse d'un regulateure optimale d'un système adaptif. Rapport interne de l'Ecole Polytechnique, Centre de Mathèmatiques Appliquées (France) Octobre, 1976. P. 1−35.",
   "Kalitine B.S. Une condition suffisante d'optimalité pour le problème de Temps Optimale pour les systèmes linèaires á structures contrôlables. “Analyse Numèrique et Foctionnelle” Université Peris VI et C.N.R.S., Laboratoire Associé, 189, Juillet 1976, № L.A. 76012. P. 1−14.",
   "Калитин Б.С. Об особых точках разрывных двумерных систем. // Вестник Белорусского ун-та. Сер. 1, физ., мат., мех., 1975. № 3. С. 9−12.",
   "Городецкий Л.М., Калитин Б.С. О системах дифференциальных уравнений, распадающихся на клетки. Четвертая Республиканская конф. Математиков Белоруссии: Тез. докл. Часть II. Минск. С. 10.",
   "Булгаков Н.Г., Калитин Б.С. К устойчивости в целом систем 2-го порядка. Четвертая Республиканская конф. Математиков Белоруссии: Тез. докл. Часть II. Минск. С. 6−7.",
   "Калитин Б.С. Исследование колебаний маятника в среде с упругой стенкой. IV // Вестник Белорусского ун-та. Сер. 1, физ., мат., мех., 1974. № 2. С. 74−79.",
   "Калитин Б.С. Исследование колебаний маятника в среде с упругой стенкой. III // Вестник Белорусского ун-та. Сер. 1, физ., мат., мех., 1974. № 1. С.58−63.",
   "Калитин Б.С. Исследование колебаний маятника в среде с упругой стенкой. II // Вестник Белорусского ун-та. Сер. 1, физ., мат., мех., 1973. № 1. С. 81−88.",
   "Калитин Б.С. Исследование колебаний маятника в среде с упругой стенкой. I // Вестник Белорусского ун-та. Сер. 1, физ., мат., мех., 1971. № 2. С. 78−82.",
   "Калитин Б.С. О колебаниях маятника в среде с упругой стенкой. Третья Республиканская конф. Математиков Белоруссии: Тез. докл. Часть II. Минск. С.",
   "Калитин Б.С. Исследование одной системы второго порядка с цилиндрическим фазовым пространством при импульсных возмущениях. Автореферат диссертации на соискание уч. степ. канд. ф.-м. наук, 1971.",
   "Калитин Б.С. Письмо в редакцию // Дифференц. уравнения. 1971. Т. 7. № 12.",
   "Калитин Б.С. Исследование колебаний маятника в среде с упругой стенкой. Всесоюзная конф. «Качественная теория дифференциальных уравнений»: Тез. докл. Свердловск, 1971. С. 54.",
   "Калитин Б.С. О предельных циклах маятниковых систем с импульсным возмущением. // Дифференц. уравнения. 1971. Т. 7. № 3. С. 540−542.",
   "Калитин Б.С. О колебаниях маятника с ударным импульсом II // Дифференц. уравнения. 1970. Т.6, № 12. С. 2174−2181.",
   "Калитин Б.С. О колебаниях маятника с ударным импульсом // Дифференц. уравнения. 1969. Т.5, № 7. С. 1267−1274."
]